#ifndef __GWINTERFACE_H__
#define __GWINTERFACE_H__
#include "GWInterfaceDef.h"

#ifdef __cplusplus
extern "C" {
#endif
//-----------------------------------------------------------------------
/*函数说明:初始化
/*参数:无
/*返回值:0表示成功，<0表示失败*/
//-----------------------------------------------------------------------
int Sipd_Init();

//-----------------------------------------------------------------------
/*函数说明:程序开始
/*参数:无
/*返回值:0表示成功，<0表示失败*/
//-----------------------------------------------------------------------
int Sipd_Start();

//-----------------------------------------------------------------------
/*函数说明:获取服务配置信息
/*参数:无
/*返回值:0表示成功，<0表示失败*/
//-----------------------------------------------------------------------
int Sipd_GetSIPServerCfg (SIPD_GATEWAY_CFG* pCfg);

//-----------------------------------------------------------------------
/*函数说明:注册服务信息变更回调
/*参数:无
/*返回值:0表示成功，<0表示失败*/
//-----------------------------------------------------------------------
int Sipd_Register_ServerConfig_CB (sip_config_pcb_func config_fun);

//-----------------------------------------------------------------------
/*函数说明:注册报警信息回调
/*参数:无
/*返回值:0表示成功，<0表示失败*/
//-----------------------------------------------------------------------
int Sipd_Register_AlarmInd_CB (sip_alarm_ind_pcb_func alarm_ind_fun);

//-----------------------------------------------------------------------
/*函数说明:设置平台时间
/*参数:无
/*返回值:0表示成功，<0表示失败*/
//-----------------------------------------------------------------------
int Sipd_settime(const sipd_id_info * pDeviceID,  const SIPD_TIME* pTime);

//-----------------------------------------------------------------------
/*函数说明:云台移动控制
/*参数:无
/*返回值:0表示成功，<0表示失败*/
//-----------------------------------------------------------------------
int Sipd_PTZ_Move(const sipd_ptz_control* pControl);

//-----------------------------------------------------------------------
/*函数说明:云台巡航控制
/*参数:无
/*返回值:0表示成功，<0表示失败*/
//-----------------------------------------------------------------------
int Sipd_PTZ_Tour(const sipd_tour_control * pTourControl);

//-----------------------------------------------------------------------
/*函数说明:预置点控制
/*参数:无
/*返回值:0表示成功，<0表示失败*/
//-----------------------------------------------------------------------
int Sipd_PTZ_Preset(const sipd_preset_control * pPresetControl);

//-----------------------------------------------------------------------
/*函数说明:自动摇摆
/*参数:无
/*返回值:0表示成功，<0表示失败*/
//-----------------------------------------------------------------------
int Sipd_PTZ_AutoScan(const sipd_autoscan_control * pAutoScanControl);

//-----------------------------------------------------------------------
/*函数说明:重启设备
/*参数:无
/*返回值:0表示成功，<0表示失败*/
//-----------------------------------------------------------------------
int Sipd_Reboot(const sipd_id_info * pIdInfo);

//-----------------------------------------------------------------------
/*函数说明:录像控制
/*参数:无
/*返回值:0表示成功，<0表示失败*/
//-----------------------------------------------------------------------
int Sipd_record_control (const sipd_record_control * pRecordControl);

//-----------------------------------------------------------------------
/*函数说明:报警控制
/*参数:无
/*返回值:0表示成功，<0表示失败*/
//-----------------------------------------------------------------------
int Sipd_alarm_control (const sipd_alarm_control * pAlarmControl);

//-----------------------------------------------------------------------
/*函数说明:注册命令控制回调
/*参数:无
/*返回值:0表示成功，<0表示失败*/
//-----------------------------------------------------------------------
int Sipd_Register_ControlRsp_CB(sip_control_req_pcb_func control_rsp_fun);

//-----------------------------------------------------------------------
/*函数说明:设备列表查询
/*参数:无
/*返回值:0表示成功，<0表示失败*/
//-----------------------------------------------------------------------
int Sipd_cataloginfo_request(const sipd_catalog_req * pCatalogReq);

//-----------------------------------------------------------------------
/*函数说明:设备信息查询
/*参数:无
/*返回值:0表示成功，<0表示失败*/
//-----------------------------------------------------------------------
int Sipd_deviceinfo_request(const sipd_deviceinfo_req * pDeviceinfoReq);

//-----------------------------------------------------------------------
/*函数说明:设备状态查询
/*参数:无
/*返回值:0表示成功，<0表示失败*/
//-----------------------------------------------------------------------
int Sipd_stateinfo_request(const sipd_devicestate_req * pStateInfoReq);

//-----------------------------------------------------------------------
/*函数说明:注册查询结果回调
/*参数:无
/*返回值:0表示成功，<0表示失败*/
//-----------------------------------------------------------------------
int Sipd_Register_InfoRsp_CB(sip_info_req_pcb_func rsp_fun);

//-----------------------------------------------------------------------
/*函数说明:录像查询
/*参数:无
/*返回值:0表示成功，<0表示失败*/
//-----------------------------------------------------------------------
int Sipd_search_recordfile_req (sipd_recordinfo_req * pRecordFileReq);

//-----------------------------------------------------------------------
/*函数说明:注册媒体控制回调
/*参数:无
/*返回值:0表示成功，其他值表示失败*/
//-----------------------------------------------------------------------
int Sipd_Register_MediaControl_CB(sip_media_pcb_func media_control_fun);

//-----------------------------------------------------------------------
/*函数说明:回放通知
/*参数:无
/*返回值:0表示成功，其他值表示失败*/
//-----------------------------------------------------------------------
int Invite_play_playback_download(const sipd_media_session* pMediaInfo);

//-----------------------------------------------------------------------
/*函数说明:通知媒体网关进行媒体控制
/*参数:无
/*返回值:0表示成功，其他值表示失败*/
//-----------------------------------------------------------------------
int Sipd_media_control_notify_CMS(const int did, const int tid, const enum SIPD_TO_CMS_CMD_TYPE cmd_type, const sipd_playback_mans_rtsp_ind* playback_rtsp_control);
//-----------------------------------------------------------------------
/*函数说明:停止
/*参数:无
/*返回值:0表示成功，其他值表示失败*/
//-----------------------------------------------------------------------
int Sipd_Stop();

//-----------------------------------------------------------------------
/*函数说明:反初始化
/*参数:无
/*返回值:0表示成功，其他值表示失败*/
//-----------------------------------------------------------------------
int Sipd_Uninit();

#ifdef __cplusplus
}
#endif

#endif

